conf/src/Documents/ЭП_КорректировкаВыплатПремий/ЭП_КорректировкаВыплатПремий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭП_КорректировкаВыплатПремий</name>
  <registerRecords>AccumulationRegister.ЭП_УчетПремийПоДокументам</registerRecords>
  <registerRecords>AccumulationRegister.ЭП_УчетПремий</registerRecords>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Этап</name>
    <type>
      <types>CatalogRef.РазделыПроекта</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.ЭП_ВидыДокументаВыплатаПремий</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.ВидДвиженияРегистра</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроектныйКоэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПремияПоЭтапу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроектнаяПремия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СреднийКоэффициентПЗК</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогСУчетомПроектногоКоэффициента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОстатокПЗК</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.РазделыПроекта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СотрудникиПоДокументам</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.ВидДвиженияРегистра</types>
      </type>
    </attributes>
    <attributes>
      <name>ТехническийПроект</name>
      <type>
        <types>CatalogRef.ТехническиеПроекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроектныйКоэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПремияПоЭтапу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроектнаяПремия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СреднийКоэффициентПЗК</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.РазделыПроекта</types>
      </type>
    </attributes>
    <attributes>
      <name>ИтогСУчетомПроектногоКоэффициента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОстатокПЗК</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

conf/src/AccumulationRegisters/ЭП_УчетПремий/ЭП_УчетПремий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЭП_УчетПремий</name>
  <resources>
    <name>ОстатокПЗК</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроектнаяПремия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПремияПоЭтапу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>CatalogRef.РазделыПроекта</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

conf/src/AccumulationRegisters/ЭП_УчетПремийПоДокументам/ЭП_УчетПремийПоДокументам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЭП_УчетПремийПоДокументам</name>
  <resources>
    <name>ОстатокПЗК</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроектнаяПремия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПремияПоЭтапу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УДАЛИТЬЭтап</name>
    <type>
      <types>CatalogRef.РазделыПроекта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТехническийПроект</name>
    <type>
      <types>CatalogRef.ТехническиеПроекты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

conf/src/Enums/ЭП_ВидыДокументаВыплатаПремий/ЭП_ВидыДокументаВыплатаПремий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭП_ВидыДокументаВыплатаПремий</name>
  <enumValues>
    <name>ВыплатаПоСопровждению</name>
  </enumValues>
  <enumValues>
    <name>ОбычнаяВыплата</name>
  </enumValues>
</mdclass:Enum>

conf/src/Enums/ВидДвиженияРегистра/ВидДвиженияРегистра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидДвиженияРегистра</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
  <enumValues>
    <name>Оборот</name>
  </enumValues>
  <enumValues>
    <name>Запись</name>
  </enumValues>
</mdclass:Enum>

conf/src/Documents/ЭП_КорректировкаВыплатПремий/ObjectModule.bsl
#Область ОбработчикиСобытий

// Движения в регистр накопления ЭП_УчетПремий и ЭП_УчетПремийПоДокументам 
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ЭП_УчетПремий.Записывать = Истина;
	Движения.ЭП_УчетПремийПоДокументам.Записывать = Истина;
	
	// Создание менеджера временных таблиц
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	Если ВидДокумента = Перечисления.ЭП_ВидыДокументаВыплатаПремий.ОбычнаяВыплата Тогда
		
		Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
			
			Движение = Движения.ЭП_УчетПремий.Добавить();
			
			Если ТекСтрокаСотрудники.ВидДвижения = Перечисления.ВидДвиженияРегистра.Приход Тогда
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Иначе
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			КонецЕсли;
			
			// регистр ЭП_УчетПремий
			Движение.Период = Дата;
			Движение.Пользователь = ТекСтрокаСотрудники.Пользователь;
			Движение.Проект = Проект;
			Движение.Этап = ТекСтрокаСотрудники.Этап;
			Движение.ОстатокПЗК = ТекСтрокаСотрудники.ОстатокПЗК;
			Движение.ПремияПоЭтапу = ТекСтрокаСотрудники.ПремияПоЭтапу;
			Движение.ПроектнаяПремия = ТекСтрокаСотрудники.ПроектнаяПремия;
			
		КонецЦикла;
	Иначе 
		Для Каждого ТекСтрокаСотрудникиПоДокументам Из СотрудникиПоДокументам Цикл
			
			Движение = Движения.ЭП_УчетПремийПоДокументам.Добавить();
			
			Если ТекСтрокаСотрудникиПоДокументам.ВидДвижения = Перечисления.ВидДвиженияРегистра.Приход Тогда
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Иначе
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			КонецЕсли;
			
			// регистр ЭП_УчетПремийПоДокументам
			Движение.Период = Дата;
			Движение.Пользователь = ТекСтрокаСотрудникиПоДокументам.Пользователь;
			Движение.Проект = Проект;
			//Движение.Этап = ТекСтрокаСотрудникиПоДокументам.Этап;
			Движение.ТехническийПроект = ТекСтрокаСотрудникиПоДокументам.ТехническийПроект;
			Движение.ОстатокПЗК = ТекСтрокаСотрудникиПоДокументам.ОстатокПЗК;
			Движение.ПремияПоЭтапу = ТекСтрокаСотрудникиПоДокументам.ПремияПоЭтапу;
			Движение.ПроектнаяПремия = ТекСтрокаСотрудникиПоДокументам.ПроектнаяПремия;	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает пользователя ответственным за документ
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();

КонецПроцедуры
#КонецОбласти
